test/pytest_example/pytest_runs_subprocess/openfoam/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version	 2.0;
	format	 ascii;
	class	 dictionary;
	object	 transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rhob 			 rhob [1 -3 0 0 0 0 0] 1.000;
nub 			 nub [0 2 -1 0 0 0 0] 1.004e-2;
nu 			     nu [0 2 -1 0 0 0 0] 1.004e-2;

transportModel 			 Newtonian;
// ************************************************************************* //
